// Задача 30: Напишите программу, которая выводит массив из 8 эллементов, 
// заполненный нулями иединицами в случайном порядке.
// [1,0,0,1,1,0,1,0]

Console.Clear();

int[] getArray()
{
    int[] array = new int[8];
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = new Random().Next(0, 2);
    }
    return array;
}

void printArray(int[] inArray)
{
    for (int i = 0; i < inArray.Length; i++)
    {
        Console.Write($"{inArray[i]}");
    }
}
int[] array = getArray();
printArray(array);