// Задача 21: Напишите программу, которая на вход принимает координаты двух точек 
// и находит расстояние между ними в 3D пространстве.

Console.Clear();

Console.Write("Введите ккординату точки x0: ");
int x0 = int.Parse(Console.ReadLine()!);

Console.Write("Введите ккординату точки y1: ");
int y0 = int.Parse(Console.ReadLine()!);

Console.Write("Введите ккординату точки x1: ");
int x1 = int.Parse(Console.ReadLine()!);

Console.Write("Введите ккординату точки y1: ");
int y1 = int.Parse(Console.ReadLine()!);

Console.Write("Введите ккординату точки x2: ");
int x2 = int.Parse(Console.ReadLine()!);

Console.Write("Введите ккординату точки y2: ");
int y2 = int.Parse(Console.ReadLine()!);


double c = Math.Pow()